zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/startup_MIMXRT758S_cm33_core1.c
//*****************************************************************************
// MIMXRT758S_cm33_core1 startup code
//
// Version : 081225
//*****************************************************************************
//
// Copyright 2016-2025 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif //(__GNUC__)
#endif //(DEBUG)

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
extern void __libc_init_array(void);
}
#endif //(__REDLIB__)
#endif //(__MCUXPRESSO)
#endif //(__cplusplus)

#define WEAK __attribute__((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__((weak))
#endif //(__MCUXPRESSO)
#define ALIAS(f) __attribute__((weak, alias(#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif //(__cplusplus)

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif //(__MCUXPRESSO)
void Reset_Handler_C(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void Reserved17_IRQHandler(void);
WEAK void Reserved18_IRQHandler(void);
WEAK void FRO2_IRQHandler(void);
WEAK void GLIKEY4_IRQHandler(void);
WEAK void UTICK1_IRQHandler(void);
WEAK void MRT1_IRQHandler(void);
WEAK void CTIMER5_IRQHandler(void);
WEAK void CTIMER6_IRQHandler(void);
WEAK void CTIMER7_IRQHandler(void);
WEAK void LPI2C15_IRQHandler(void);
WEAK void LP_FLEXCOMM17_IRQHandler(void);
WEAK void LP_FLEXCOMM18_IRQHandler(void);
WEAK void LP_FLEXCOMM19_IRQHandler(void);
WEAK void LP_FLEXCOMM20_IRQHandler(void);
WEAK void ADC_IRQHandler(void);
WEAK void SDADC_IRQHandler(void);
WEAK void GLIKEY1_IRQHandler(void);
WEAK void ACMP_IRQHandler(void);
WEAK void PDM_EVENT_IRQHandler(void);
WEAK void HYPERVISOR_IRQHandler(void);
WEAK void SECURE_VIOLATION_IRQHandler(void);
WEAK void PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void RTC1_ALARM_IRQHandler(void);
WEAK void RTC1_IRQHandler(void);
WEAK void HIFI1_IRQHandler(void);
WEAK void MU1_B_IRQHandler(void);
WEAK void Reserved43_IRQHandler(void);
WEAK void MU3_A_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void USDHC0_IRQHandler(void);
WEAK void USDHC1_IRQHandler(void);
WEAK void I3C2_IRQHandler(void);
WEAK void USB0_IRQHandler(void);
WEAK void USB1_IRQHandler(void);
WEAK void WDT2_IRQHandler(void);
WEAK void WDT3_IRQHandler(void);
WEAK void USBPHY0_IRQHandler(void);
WEAK void Reserved55_IRQHandler(void);
WEAK void I3C3_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void LCDIF_IRQHandler(void);
WEAK void VGPU_IRQHandler(void);
WEAK void MIPI_IRQHandler(void);
WEAK void EDMA2_CH0_IRQHandler(void);
WEAK void EDMA2_CH1_IRQHandler(void);
WEAK void EDMA2_CH2_IRQHandler(void);
WEAK void EDMA2_CH3_IRQHandler(void);
WEAK void EDMA2_CH4_IRQHandler(void);
WEAK void EDMA2_CH5_IRQHandler(void);
WEAK void EDMA2_CH6_IRQHandler(void);
WEAK void EDMA2_CH7_IRQHandler(void);
WEAK void EDMA3_CH0_IRQHandler(void);
WEAK void EDMA3_CH1_IRQHandler(void);
WEAK void EDMA3_CH2_IRQHandler(void);
WEAK void EDMA3_CH3_IRQHandler(void);
WEAK void EDMA3_CH4_IRQHandler(void);
WEAK void EDMA3_CH5_IRQHandler(void);
WEAK void EDMA3_CH6_IRQHandler(void);
WEAK void EDMA3_CH7_IRQHandler(void);
WEAK void GPIO80_IRQHandler(void);
WEAK void GPIO81_IRQHandler(void);
WEAK void GPIO90_IRQHandler(void);
WEAK void GPIO91_IRQHandler(void);
WEAK void GPIO100_IRQHandler(void);
WEAK void GPIO101_IRQHandler(void);
WEAK void Reserved83_IRQHandler(void);
WEAK void Reserved84_IRQHandler(void);
WEAK void PIN_INT0_IRQHandler(void);
WEAK void PIN_INT1_IRQHandler(void);
WEAK void PIN_INT2_IRQHandler(void);
WEAK void PIN_INT3_IRQHandler(void);
WEAK void SAI3_IRQHandler(void);
WEAK void XSPI2_IRQHandler(void);
WEAK void MMU2_IRQHandler(void);
WEAK void Reserved92_IRQHandler(void);
WEAK void GDET3_IRQHandler(void);
WEAK void CDOG3_IRQHandler(void);
WEAK void CDOG4_IRQHandler(void);
WEAK void Reserved96_IRQHandler(void);
WEAK void CPU1_IRQHandler(void);
WEAK void JPEGDEC_IRQHandler(void);
WEAK void PNGDEC_IRQHandler(void);
WEAK void Reserved100_IRQHandler(void);
WEAK void TEMPDET0_IRQHandler(void);
WEAK void TEMPDET1_IRQHandler(void);
WEAK void EZHV_IRQHandler(void);
WEAK void SLEEPCON1_IRQHandler(void);
WEAK void PVTS1_CPU1_IRQHandler(void);
WEAK void Reserved106_IRQHandler(void);
WEAK void PVTS1_HIFI1_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved17_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved18_DriverIRQHandler(void) ALIAS(DefaultISR);
void FRO2_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY4_DriverIRQHandler(void) ALIAS(DefaultISR);
void UTICK1_DriverIRQHandler(void) ALIAS(DefaultISR);
void MRT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER5_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER6_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER7_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C15_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM17_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM18_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM19_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM20_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC_DriverIRQHandler(void) ALIAS(DefaultISR);
void SDADC_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY1_DriverIRQHandler(void) ALIAS(DefaultISR);
void ACMP_DriverIRQHandler(void) ALIAS(DefaultISR);
void PDM_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void HYPERVISOR_DriverIRQHandler(void) ALIAS(DefaultISR);
void SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(DefaultISR);
void PDM_HWVAD_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC1_ALARM_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void HIFI1_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved43_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU3_A_DriverIRQHandler(void) ALIAS(DefaultISR);
void PMC_DriverIRQHandler(void) ALIAS(DefaultISR);
void OS_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void USDHC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void USDHC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C2_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB0_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB1_DriverIRQHandler(void) ALIAS(DefaultISR);
void WDT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void WDT3_DriverIRQHandler(void) ALIAS(DefaultISR);
void USBPHY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved55_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C3_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void LCDIF_DriverIRQHandler(void) ALIAS(DefaultISR);
void VGPU_DriverIRQHandler(void) ALIAS(DefaultISR);
void MIPI_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA2_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA3_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO80_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO81_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO90_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO91_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO100_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO101_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved83_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved84_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT3_DriverIRQHandler(void) ALIAS(DefaultISR);
void SAI3_DriverIRQHandler(void) ALIAS(DefaultISR);
void XSPI2_DriverIRQHandler(void) ALIAS(DefaultISR);
void MMU2_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved92_DriverIRQHandler(void) ALIAS(DefaultISR);
void GDET3_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG3_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG4_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved96_DriverIRQHandler(void) ALIAS(DefaultISR);
void CPU1_DriverIRQHandler(void) ALIAS(DefaultISR);
void JPEGDEC_DriverIRQHandler(void) ALIAS(DefaultISR);
void PNGDEC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved100_DriverIRQHandler(void) ALIAS(DefaultISR);
void TEMPDET0_DriverIRQHandler(void) ALIAS(DefaultISR);
void TEMPDET1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EZHV_DriverIRQHandler(void) ALIAS(DefaultISR);
void SLEEPCON1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PVTS1_CPU1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved106_DriverIRQHandler(void) ALIAS(DefaultISR);
void PVTS1_HIFI1_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void __main(void);
#elif defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif //(__REDLIB__)
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif //(__REDLIB__)
#else
#error Unsupported toolchain!
#endif //(__MCUXPRESSO)

//*****************************************************************************
// External declaration for the pointer from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Base[];
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#define _vStackTop  Image$$ARM_LIB_STACK$$ZI$$Limit
#define _vStackBase Image$$ARM_LIB_STACK$$ZI$$Base
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
#define Reset_Handler ResetISR // To be compatible with other compilers
#elif defined(__ICCARM__)
#pragma segment = "CSTACK"
#define _vStackTop  __section_end("CSTACK")
#define _vStackBase __section_begin("CSTACK")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

