zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/startup_MIMXRT758S_cm33_core1.c
WEAK void LPI2C15_IRQHandler(void)
{
    LPI2C15_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM17_IRQHandler(void)
{
    LP_FLEXCOMM17_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM18_IRQHandler(void)
{
    LP_FLEXCOMM18_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM19_IRQHandler(void)
{
    LP_FLEXCOMM19_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM20_IRQHandler(void)
{
    LP_FLEXCOMM20_DriverIRQHandler();
}

WEAK void ADC_IRQHandler(void)
{
    ADC_DriverIRQHandler();
}

WEAK void SDADC_IRQHandler(void)
{
    SDADC_DriverIRQHandler();
}

WEAK void GLIKEY1_IRQHandler(void)
{
    GLIKEY1_DriverIRQHandler();
}

WEAK void ACMP_IRQHandler(void)
{
    ACMP_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{
    PDM_EVENT_DriverIRQHandler();
}

WEAK void HYPERVISOR_IRQHandler(void)
{
    HYPERVISOR_DriverIRQHandler();
}

WEAK void SECURE_VIOLATION_IRQHandler(void)
{
    SECURE_VIOLATION_DriverIRQHandler();
}

WEAK void PDM_HWVAD_EVENT_IRQHandler(void)
{
    PDM_HWVAD_EVENT_DriverIRQHandler();
}

WEAK void RTC1_ALARM_IRQHandler(void)
{
    RTC1_ALARM_DriverIRQHandler();
}

WEAK void RTC1_IRQHandler(void)
{
    RTC1_DriverIRQHandler();
}

WEAK void HIFI1_IRQHandler(void)
{
    HIFI1_DriverIRQHandler();
}

WEAK void MU1_B_IRQHandler(void)
{
    MU1_B_DriverIRQHandler();
}

WEAK void Reserved43_IRQHandler(void)
{
    Reserved43_DriverIRQHandler();
}

WEAK void MU3_A_IRQHandler(void)
{
    MU3_A_DriverIRQHandler();
}

WEAK void PMC_IRQHandler(void)
{
    PMC_DriverIRQHandler();
}

WEAK void OS_EVENT_IRQHandler(void)
{
    OS_EVENT_DriverIRQHandler();
}

WEAK void USDHC0_IRQHandler(void)
{
    USDHC0_DriverIRQHandler();
}

WEAK void USDHC1_IRQHandler(void)
{
    USDHC1_DriverIRQHandler();
}

WEAK void I3C2_IRQHandler(void)
{
    I3C2_DriverIRQHandler();
}

WEAK void USB0_IRQHandler(void)
{
    USB0_DriverIRQHandler();
}

WEAK void USB1_IRQHandler(void)
{
    USB1_DriverIRQHandler();
}

WEAK void WDT2_IRQHandler(void)
{
    WDT2_DriverIRQHandler();
}

WEAK void WDT3_IRQHandler(void)
{
    WDT3_DriverIRQHandler();
}

WEAK void USBPHY0_IRQHandler(void)
{
    USBPHY0_DriverIRQHandler();
}

WEAK void Reserved55_IRQHandler(void)
{
    Reserved55_DriverIRQHandler();
}

WEAK void I3C3_IRQHandler(void)
{
    I3C3_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{
    FLEXIO_DriverIRQHandler();
}

WEAK void LCDIF_IRQHandler(void)
{
    LCDIF_DriverIRQHandler();
}

WEAK void VGPU_IRQHandler(void)
{
    VGPU_DriverIRQHandler();
}

WEAK void MIPI_IRQHandler(void)
{
    MIPI_DriverIRQHandler();
}

WEAK void EDMA2_CH0_IRQHandler(void)
{
    EDMA2_CH0_DriverIRQHandler();
}

WEAK void EDMA2_CH1_IRQHandler(void)
{
    EDMA2_CH1_DriverIRQHandler();
}

WEAK void EDMA2_CH2_IRQHandler(void)
{
    EDMA2_CH2_DriverIRQHandler();
}

WEAK void EDMA2_CH3_IRQHandler(void)
{
    EDMA2_CH3_DriverIRQHandler();
}

WEAK void EDMA2_CH4_IRQHandler(void)
{
    EDMA2_CH4_DriverIRQHandler();
}

WEAK void EDMA2_CH5_IRQHandler(void)
{
    EDMA2_CH5_DriverIRQHandler();
}

WEAK void EDMA2_CH6_IRQHandler(void)
{
    EDMA2_CH6_DriverIRQHandler();
}

WEAK void EDMA2_CH7_IRQHandler(void)
{
    EDMA2_CH7_DriverIRQHandler();
}

WEAK void EDMA3_CH0_IRQHandler(void)
{
    EDMA3_CH0_DriverIRQHandler();
}

WEAK void EDMA3_CH1_IRQHandler(void)
{
    EDMA3_CH1_DriverIRQHandler();
}

WEAK void EDMA3_CH2_IRQHandler(void)
{
    EDMA3_CH2_DriverIRQHandler();
}

WEAK void EDMA3_CH3_IRQHandler(void)
{
    EDMA3_CH3_DriverIRQHandler();
}

WEAK void EDMA3_CH4_IRQHandler(void)
{
    EDMA3_CH4_DriverIRQHandler();
}

WEAK void EDMA3_CH5_IRQHandler(void)
{
    EDMA3_CH5_DriverIRQHandler();
}

WEAK void EDMA3_CH6_IRQHandler(void)
{
    EDMA3_CH6_DriverIRQHandler();
}

WEAK void EDMA3_CH7_IRQHandler(void)
{
    EDMA3_CH7_DriverIRQHandler();
}

WEAK void GPIO80_IRQHandler(void)
{
    GPIO80_DriverIRQHandler();
}

WEAK void GPIO81_IRQHandler(void)
{
    GPIO81_DriverIRQHandler();
}

WEAK void GPIO90_IRQHandler(void)
{
    GPIO90_DriverIRQHandler();
}

WEAK void GPIO91_IRQHandler(void)
{
    GPIO91_DriverIRQHandler();
}

WEAK void GPIO100_IRQHandler(void)
{
    GPIO100_DriverIRQHandler();
}

WEAK void GPIO101_IRQHandler(void)
{
    GPIO101_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{
    Reserved83_DriverIRQHandler();
}

WEAK void Reserved84_IRQHandler(void)
{
    Reserved84_DriverIRQHandler();
}

WEAK void PIN_INT0_IRQHandler(void)
{
    PIN_INT0_DriverIRQHandler();
}

WEAK void PIN_INT1_IRQHandler(void)
{
    PIN_INT1_DriverIRQHandler();
}

WEAK void PIN_INT2_IRQHandler(void)
{
    PIN_INT2_DriverIRQHandler();
}

WEAK void PIN_INT3_IRQHandler(void)
{
    PIN_INT3_DriverIRQHandler();
}

WEAK void SAI3_IRQHandler(void)
{
    SAI3_DriverIRQHandler();
}

WEAK void XSPI2_IRQHandler(void)
{
    XSPI2_DriverIRQHandler();
}

WEAK void MMU2_IRQHandler(void)
{
    MMU2_DriverIRQHandler();
}

WEAK void Reserved92_IRQHandler(void)
{
    Reserved92_DriverIRQHandler();
}

WEAK void GDET3_IRQHandler(void)
{
    GDET3_DriverIRQHandler();
}

WEAK void CDOG3_IRQHandler(void)
{
    CDOG3_DriverIRQHandler();
}

WEAK void CDOG4_IRQHandler(void)
{
    CDOG4_DriverIRQHandler();
}

WEAK void Reserved96_IRQHandler(void)
{
    Reserved96_DriverIRQHandler();
}

WEAK void CPU1_IRQHandler(void)
{
    CPU1_DriverIRQHandler();
}

WEAK void JPEGDEC_IRQHandler(void)
{
    JPEGDEC_DriverIRQHandler();
}

WEAK void PNGDEC_IRQHandler(void)
{
    PNGDEC_DriverIRQHandler();
}

WEAK void Reserved100_IRQHandler(void)
{
    Reserved100_DriverIRQHandler();
}

WEAK void TEMPDET0_IRQHandler(void)
{
    TEMPDET0_DriverIRQHandler();
}

WEAK void TEMPDET1_IRQHandler(void)
{
    TEMPDET1_DriverIRQHandler();
}

WEAK void EZHV_IRQHandler(void)
{
    EZHV_DriverIRQHandler();
}

WEAK void SLEEPCON1_IRQHandler(void)
{
    SLEEPCON1_DriverIRQHandler();
}

WEAK void PVTS1_CPU1_IRQHandler(void)
{
    PVTS1_CPU1_DriverIRQHandler();
}

WEAK void Reserved106_IRQHandler(void)
{
    Reserved106_DriverIRQHandler();
}

WEAK void PVTS1_HIFI1_IRQHandler(void)
{
    PVTS1_HIFI1_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif //(__GNUC__)
#endif //(DEBUG)
